package com.demo.rsa.RSAUtils;

import org.apache.commons.codec.binary.Base64;

import java.security.KeyFactory;
import java.security.PrivateKey;
import java.security.PublicKey;
import java.security.Security;
import java.security.spec.PKCS8EncodedKeySpec;
import java.security.spec.X509EncodedKeySpec;

/**
 *
 * 批量加密
 *
 *
 * */
public class RSATest {

    public static void testRsa() {
        try {
            Security.addProvider(new org.bouncycastle.jce.provider.BouncyCastleProvider());

            //公钥
            String strpk = "MFwwDQYJKoZIhvcNAQEBBQADSwAwSAJBAKo7x+FfFw90b7izTpSZTcyHLjWPC6N5RiKA" +
                    "PujgkW52qGqny06y8fINZaQ/mXd2pThF4gfzuMgs14BVYBl2n7sCAwEAAQ==";
            //私钥
            String strprivk = "MIIBVQIBADANBgkqhkiG9w0BAQEFAASCAT8wggE7AgEAAkEAqjvH4V8XD3RvuLNOlJ" +
                    "lNzIcuNY8Lo3lGIoA+6OCRbnaoaqfLTrLx8g1lpD+Zd3alOEXiB/O4yCzXgFVgGXafuwIDAQABAkE" +
                    "Ai6x5F8V5mkii0hzswKf4WXQgyfkQR5Tdorku5Mw9BzAhQDN/mQ4Bd6lInHpb223H0fuYwkHCnj6wE" +
                    "YgNzSjE4QIhAPZa+L4FjQ64RUYNMmllZdTglYNUb4SmpITC7tzM3ypdAiEAsOXmKhOg5VAC49LVY5z" +
                    "J8CCF6MG/tcJY+GqF6yfrwPcCIQC4Kn/jhkDSLT1URg9WrT+4KYB8IkYP84fv2843cEyw3QIgXEOsp" +
                    "qmSM8hlmXovvkLauJnd/iZ/3Uc+rGKy8pHhzsUCIDS50cv9NdsVB/yXKtBQFpiGlfpICV1n0q8IP8m" +
                    "R0D+O";

            X509EncodedKeySpec pubX509 = new X509EncodedKeySpec(Base64.decodeBase64(strpk.getBytes()));
            PKCS8EncodedKeySpec priPKCS8 = new PKCS8EncodedKeySpec(Base64.decodeBase64(strprivk.getBytes()));

            KeyFactory keyf = KeyFactory.getInstance("RSA", "BC");
            PublicKey pubKey = keyf.generatePublic(pubX509);
            PrivateKey privKey = keyf.generatePrivate(priPKCS8);

            RSAUtil rsaUtil =  new RSAUtil();


            String[] datas = {"姓名/身份证号/电话号码/三要素MD5简版/三要素MD5详版/",
                    /*"吕洲/421126198602190011/18666096718/验证不一致/手机号已实名，但是身份证和姓名均与实名信息不一致/",
                    "陈永齐/610431197908204911/13602601050/验证一致//",
                    "王绍芹/330623197512063861/13530258166/验证不一致//",
                    "闫士伟/341221197905242818/15217766608/验证一致//",
                    "潘强/452526197810190618/13692208455/查无记录//",
                    "刘瑾/372923198308214722/13510912041/验证一致//",
                    "杨乐/513029198305165239/13715258572/验证一致//",
                    "余小丽/440233198207030028/13824452931/验证一致//",
                    "徐彬/340104197910261519/18682286723/验证一致/三要素一致/",
                    "李秋花/410522198208102881/13528890115/验证一致//",
                    "梁静舒/44092319860928056X/13714670211/验证不一致//",
                    "李岚/450302198410241544/15989525181/验证一致//",
                    "巫菊明/441622197704045465/13632840591/验证一致//",
                    "魏艳芳/420621197908205167/13689599782/验证不一致//",
                    "戴敏/360281197601138025/13823736041/验证一致//",
                    "刘学军/432325197905054351/13826935638/验证一致//",
                    "王艳霞/370202197411023928/13510878769/验证一致//",
                    "罗剑平/440784198909233011/18138083111/验证一致/三要素一致/",
                    "严伟文/441623195809180011/13802563528/验证一致//",
                    "蔡向峰/36222619720410091X/13510655595/验证一致//",
                    "许阳丰/440509197807164830/13798294268/验证一致//",
                    "丁跃伟/410327197610046458/13751196618/验证一致//",
                    "邹云波/421083198208260933/13360090588/验证一致/三要素一致/",
                    "林立/44152219671120011X/13828991189/验证一致//",
                    "唐黄黄/430626197404141829/13602533290/验证不一致//",
                    "何善林/362428198309148213/13532383237/验证一致//",
                    "杨家权/522627197601100815/13410575022/验证一致//",
                    "陈国亮/429006198403163076/13428975770/验证一致//",
                    "林辉民/441522197602033038/13823201182/验证不一致//",
                    "张建勇/433024196809107592/13554757010/验证一致//",
                    "林浩亮/441522198106123071/13510923298/验证一致//",
                    "张霞/445222198109270066/13923848013/验证不一致//",
                    "李建华/360104197703140419/13570821561/验证一致//",
                    "翟睿俊/440301199007304417/13510723975/验证一致//",
                    "童彬彬/330226198306294310/13829298744/验证不一致//",
                    "谢达扬/441426197703061433/15919498122/验证不一致//",
                    "郭华英/362122197402283541/13352969713/验证不一致/手机号已实名，但是身份证和姓名均与实名信息不一致/",
                    "刘静明/441602198207190636/13570863413/验证一致//",
                    "郑学浩/460025197105262731/13510381365/验证一致//",
                    "高金满/441227196807063012/13652447566/验证一致//",
                    "侯志宏/440301197610152711/18898659813/验证一致//",
                    "齐娜/610102198403071945/13420933400/验证一致//",
                    "刘胜兰/432326197306013343/13924628093/验证一致//",
                    "张星/420902198611050020/18927421013/验证一致/三要素一致/",
                    "苏汉波/441521197412201137/13539548325/验证一致//",
                    "张国富/510225197312053233/13530769686/验证一致//",
                    "康宏君/362426197907274378/13537778867/验证一致//",
                    "蒋国樑/362401197611110537/18607077790/验证一致/三要素一致/",
                    "叶达伟/44088319910510295X/13632722147/验证一致//",
                    "王量良/360313198312233513/13590163698/验证一致//",
                    "唐辉/429006198103165491/18620531303/验证不一致/手机号已实名，但是身份证和姓名均与实名信息不一致/",
                    "张勇/42282619810525401X/18923859930/验证不一致/手机号已实名，手机号和姓名一致，身份证不一致/",
                    "罗礼东/511322198610081314/15875556850/验证一致//",
                    "易翔/430204198801301018/13148780610/验证一致/三要素一致/",
                    "陈曦/230302198205074109/13924662775/验证一致//",
                    "舒灵军/431223198310133419/18211439501/验证不一致//",
                    "邹维/430621198808071014/15200915200/验证一致//",
                    "刘建梅/440301196908281722/13640937969/验证一致//",
                    "陈燕兰/440229198709121988/18682260147/验证不一致/手机号已实名，但是身份证和姓名均与实名信息不一致/",
                    "林若钦/445122197804164716/13926108130/验证一致//",
                    "刘洪海/460021197609252056/13823364576/验证一致//",
                    "刘非同/430424198501096418/18565659185/验证一致/三要素一致/",
                    "钟立勇/362227197207302214/13713908415/验证一致//",
                    "王杰/320405198503202515/13544106733/验证一致//",
                    "于景礼/230521198102071917/13923785688/验证一致//",
                    "高洋/420683199203052111/13049888780/验证不一致/手机号已实名，但是身份证和姓名均与实名信息不一致/",
                    "高江/150204197910142413/18922866668/验证不一致/手机号已实名，但是身份证和姓名均与实名信息不一致/",
                    "张云芝/510322198104020526/13510539546/验证一致//",
                    "王伟/362302198311075018/13925216116/验证一致//",
                    "周刚/420881198712152958/17603044240/验证一致/三要素一致/",
                    "郭辉/411325198511255038/13430543248/验证一致//",
                    "蓝翠娟/440224197911030960/13602663499/验证一致//",
                    "蒋燕川/500228198705090934/13430593635/验证一致//",
                    "汤春芳/422129198101033325/13423777742/验证一致//",
                    "叶燕瑜/440301198702013828/15986616912/验证一致//",
                    "徐培志/45242119800905081X/18024590393/验证一致/三要素一致/",
                    "叶柳/50022819850111413X/13714432145/验证一致//",
                    "王娅竹/510921198704290040/13428990426/查无记录//",
                    "丘衍欢/441523197510195511/13809886323/验证一致//",
                    "吴海娇/452123198810071049/18576460268/验证不一致/手机号已实名，但是身份证和姓名均与实名信息不一致/",
                    "朱正/440301199002218034/13717033150/验证一致//",
                    "刘雪芬/440321197102054627/13509677695/验证一致//",
                    "王锋/340621197704041631/18007523850/验证一致/三要素一致/",
                    "时海建/412702198205163213/13631551675/验证一致//",
                    "张红林/411322198309273815/13802456126/验证一致//",
                    "刘莉丽/440202195811090627/13312922836/验证一致/三要素一致/",
                    "高健/211282198802070812/15013722251/验证一致//",
                    "马云富/51302919740708315X/13510915535/验证一致//",
                    "罗道锋/433027197809015819/13556852396/验证一致//",
                    "叶萱芝/430403196407250043/13632823511/验证一致//",
                    "韦敏刚/452722197508181572/13603037648/查无记录//",
                    "温祖远/441522197110061737/13510061737/验证不一致//",
                    "田玉琴/510727198903041327/13570816869/验证不一致//",
                    "孙志宏/422324197003300017/18682327598/验证不一致/手机号已实名，手机号和证件号一致，姓名不一致/",
                    "陈裕/440582198912140410/15919650155/验证一致//",
                    "姚志德/441422198007042617/15112341583/验证一致//",
                    "王有慧/630105198401181318/15989383401/验证一致//",
                    "汤良辉/441427198008050039/13751063125/验证一致//",
                    "张启航/441424198703083810/13828890292/验证不一致//",*/
                    "田宁军/61012419830111181X/15889685430/验证一致//"};
            for(int i=0;i<datas.length;i++){
                String encryptData = null;
                if (pubKey != null) {
                    encryptData = rsaUtil.encryptData(datas[i], pubKey);
                    System.out.println(encryptData);
                }
            }
           
        }catch (Exception e) {
            e.printStackTrace();
        }
    }
    public static void main(String args[]) {
        testRsa();
    }
}
